#Цель: Написать программу на языке Python, используя Pycharm, для демонстрации динамической типизации.
name = 'Vladimir'
print(name)
age = 19
print(age)
age = age + 7
print(age)
is_strue = True
print(is_strue)