#Цель: Написать программу на языке Python, используя Pycharm, для демонстрации динамической типизации.
name = 'Vladimir'
print(name)
age = 19
print(age)
new_age = 20
print(new_age)
is_strue = True
print(is_strue)

print("Здравствуйте, меня зовут " + name + ". Мне " + str(age) + " лет, а не " + str(new_age) + ", и вся эта информация " + str(is_strue) + '!')